Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/COMP_E_356.0.xml
    <register id="CEINT" width="16" offset="0xC" internal="0" description="Comparator Interrupt Control Register">
        <bitfield id="CEIFG" description="Comparator output interrupt flag" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CEIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="CEIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="CEIIFG" description="Comparator output inverted interrupt flag" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="CEIIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="CEIIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="CERDYIFG" description="Comparator ready interrupt flag" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="CERDYIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="CERDYIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="CEIE" description="Comparator output interrupt enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="CEIIE" description="Comparator output interrupt enable inverted polarity" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="CERDYIE" description="Comparator ready interrupt enable" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
    <register id="CEIV" width="16" offset="0xE" internal="0" description="Comparator Interrupt Vector Word Register">
        <bitfield id="CEIV" description="Comparator interrupt vector word register" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="CEIFG" value="0x2" description="Interrupt Source: CEOUT interrupt; Interrupt Flag: CEIFG; Interrupt Priority: Highest"/>
            <bitenum id="CEIIFG" value="0x4" description="Interrupt Source: CEOUT interrupt inverted polarity; Interrupt Flag: CEIIFG"/>
            <bitenum id="CERDYIFG" value="0xA" description="Interrupt Source: Comparator ready interrupt; Interrupt Flag: CERDYIFG; Interrupt Priority: Lowest"/>
        </bitfield>
    </register>
</module>
